import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex)

const invitation = { // invitation 网页的数据源
  state:{
    inv_tableData: [
      {
        date: "2016-05-02",
        name: "王小虎",
        address: "上海市普陀区金沙江路 1518 弄"
      },
      {
        date: "2016-05-04",
        name: "招标",
        address: "中共紫金县委办公室办公耗材采购采购计划"
      },
      {
        date: "2016-05-01",
        name: "中标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "招标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "招标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "预发",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "中标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-03",
        name: "招标",
        address: "上海市普陀区金沙江路 1516 弄"
      },
      {
        date: "2016-05-04",
        name: "招标",
        address: "	中共紫金县委办公室办公耗材采购采购计划"
      },
      {
        date: "2016-05-01",
        name: "中标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "招标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "招标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "预发",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "中标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-03",
        name: "招标",
        address: "上海市普陀区金沙江路 1516 弄"
      },
      {
        date: "2016-05-04",
        name: "招标",
        address: "	中共紫金县委办公室办公耗材采购采购计划"
      },
      {
        date: "2016-05-01",
        name: "中标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "招标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "招标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "预发",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "中标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-03",
        name: "招标",
        address: "上海市普陀区金沙江路 1516 弄"
      },
      {
        date: "2016-05-04",
        name: "招标",
        address: "	中共紫金县委办公室办公耗材采购采购计划"
      },
      {
        date: "2016-05-01",
        name: "中标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "招标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "招标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "预发",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "中标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-03",
        name: "招标",
        address: "上海市普陀区金沙江路 1516 弄"
      },
      {
        date: "2016-05-04",
        name: "招标",
        address: "	中共紫金县委办公室办公耗材采购采购计划"
      },
      {
        date: "2016-05-01",
        name: "中标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "招标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "招标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "预发",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-01",
        name: "中标",
        address:
          "耀州区瑶曲镇下石节小学操场硬化及基础设施建设项目中标结果公示"
      },
      {
        date: "2016-05-03",
        name: "招标",
        address: "上海市普陀区金沙江路 1516 弄"
      }
    ]
  },
  getters:{},
  mutations:{},
  actions:{}
}




export default new Vuex.Store({
  // state: {
  // },
  // mutations: {
  // },
  // actions: {
  // },
  modules: {
    invitation
  }

})
